package classes;

public class PrizesToBeAwarded {
    private Prize Prizes; //список призов для вручения

    public void GetNextPrize() {
        //С помощью метода выбора призовой игрушки – мы получаем эту призовую игрушку
    }

    public void AwardPrizeToOwner() {
        // метод – получения призовой игрушки.
        // После его вызова – мы удаляем из списка\массива первую игрушку
        // и сдвигаем массив. А эту игрушку записываем в текстовый файл.
        // Не забываем уменьшить количество игрушек
    }
}
